sulaolab/dspic33ck-hal-lab/src/boards/ev88g73a/main.c
/*
 * Console module 't' (audio transport) -- runtime path and load controls, reached through
 * console_board_onmsg() in ev88g73a_console_out.c.
 *
 * WHY IT IS IN THIS FILE. The command needs s_wm8904_audio, which is the profile's
 * config and belongs beside the port struct above rather than in a console file that
 * would then have to know this board's TDM geometry. So the handler is here, next to
 * what it controls, and the board's console file only routes the letter -- the same
 * division uart_app/console_dispatch.c uses for the shared modules.
 *
 * WHY 't'. console_dispatch.c reserves it for audio transport, to keep sonora's *tr
 * meaning the same thing across the fleet. This is the first command to claim it.
 *
 *   *tp  advance the block path: gain -> copy -> mute -> gain (gain is the boot default)
 *   *tp0000..*tp0003  select one: 0 copy, 1 mute, 2 tone, 3 gain. Tone is NOT in the
 *        cycle -- it drives the output with a synthetic 1 kHz, so it is asked for by
 *        index rather than arrived at by one keystroke too many (see wm8904_audio.h)
 *   ?tp  the current path, plus what CODEC-IN carries (peak level + active slot mask)
 *   *tq0000  stop the periodic TDM1 load line;  *tq0001  resume it (on after a bring-up)
 *   ?tq  whether that line is on, plus ONE full line including last/deadline
 *   *ts  analog-mute WM8904, then halt TDM/DMA (use before flashing); ?ts reports state
 *   ?ta  time the AVAS synth in the foreground, whole + per part (safe: no audio)
 *   *tb000f which AVAS parts run: 1=carriers 2=envelope 4=gate 8=noise; ?tb reports
 *   *ta0001 select the AVAS path / *ta0000 leave it -- NOT a *tp position, because
 *        an overrun there re-enters the block ISR forever and kills the console
 *   *ti<NNNN> PRE gain, tenths of a dB, SIGNED (two's complement): *ti0000 = 0.0 dB,
 *        *ti003C = +6.0 dB, *tiFFF6 = -1.0 dB. ?ti reports it and the clamp count
 *   *to<NNNN> POST gain, same units and same grammar. ?to likewise
 *
 * THREE OF THESE ARE OPTIONAL: ?ta, *tb/?tb and *tl are gated by
 * WM8904_AUDIO_ENABLE_TDM_DIAG (wm8904_audio.h), which a two-voice image turns off to buy
 * the program memory the second voice needs. In such an image *tb and *tl are ABSENT --
 * ERR_NOT_FOUND like any unknown letter, the same treatment *tm gets and for the same
 * reason (a "not built" reply is a string). ?ta answers ERR_UNSUPPORTED instead, because
 * the letter 'a' is still here for *ta0000 and *ta0001. Everything else in the list above is
 * present in every image, deliberately: see the macro's comment for which and why.
 */
void ev88g73a_transport_console_onmsg(app_console_msg_t *msg);

void ev88g73a_transport_console_onmsg(app_console_msg_t *msg)
{
    if (msg == NULL) {
        return;
    }

    if (msg->name == 'p') {
        if (msg->kind == '?') {
            wm8904_audio_path_report();
            msg->status = APP_CONSOLE_OK;
            return;
        }

        /*
         * Bare *tp cycles; *tp<NNNN> selects a path by index. The payload is optional here,
         * unlike *tq below, and that asymmetry is deliberate: a bare *tq would have to mean
         * "whichever state you are not in", while a bare *tp has an unambiguous meaning of
         * its own (advance, and say where it landed) that has been this board's habit since
         * the command existed. The indexed form exists for the one path kept out of the
         * cycle -- *tp0002, tone. Widths are a typing convention, so accept one or two
         * bytes exactly as *tq does.
         */
        if (msg->data_len == 0u) {
            wm8904_audio_path_next();
            msg->status = APP_CONSOLE_OK;
            return;
        }

        if (msg->data_len > 2u) {
            console_out_str(" *tp: value is 0000..0003, or omit it to cycle\n");
            msg->status = APP_CONSOLE_ERR_BAD_PARM_LEN;
            return;
        }

        {
            const uint16_t value =
                (msg->data_len == 2u)
                    ? (uint16_t)(((uint16_t)msg->data[0] << 8) | (uint16_t)msg->data[1])
                    : (uint16_t)msg->data[0];

            msg->status = wm8904_audio_path_set(value) ? APP_CONSOLE_OK
                                                       : APP_CONSOLE_ERR_BAD_DATA;
        }
        return;
    }

    /*
     * 'a' -- the AVAS synth. `?ta` times the engine in the foreground; `*ta0001`
     * STARTS the synth and `*ta0000` STOPS it, which fades out over ~3 s rather than
     * cutting -- it is a stage of the chain path now, not a path of its own (see
     * wm8904_audio.h). Same explicit-value grammar as *tq below, for the same reason --
     * a bare *ta must not mean "whichever state you are not in" when one of those
     * states can hang the console.
     */
    if (msg->name == 'a') {
        if (msg->kind == '?') {
#if WM8904_AUDIO_ENABLE_TDM_DIAG
            if (msg->data_len != 0u) {
                console_out_str(" ?ta: takes no value\n");
                msg->status = APP_CONSOLE_ERR_BAD_PARM_LEN;
                return;
            }
            wm8904_audio_avas_bench();
            msg->status = APP_CONSOLE_OK;
#else
            /* The bench is not in this image (WM8904_AUDIO_ENABLE_TDM_DIAG=0). The status
             * code alone, with no line of its own: a "not built" reply is a string, and the
             * string is what the gate exists to buy back. *ta itself is unaffected -- the
             * letter is here, only its query form is gone, which is why this cannot simply
             * fall through to ERR_NOT_FOUND the way *tb and *tl do. */
            msg->status = APP_CONSOLE_ERR_UNSUPPORTED;
#endif
            return;
        }

        {
            uint16_t value;

            if ((msg->data_len == 0u) || (msg->data_len > 2u)) {
                console_out_str(" *ta: needs a value -- *ta0000 = stop (~3 s fade),"
                                " *ta0001 = start (measure with ?ta first)\n");
                msg->status = APP_CONSOLE_ERR_BAD_PARM_LEN;
                return;
            }

            value = (msg->data_len == 2u)
                        ? (uint16_t)(((uint16_t)msg->data[0] << 8) | (uint16_t)msg->data[1])
                        : (uint16_t)msg->data[0];

            if (value > 1u) {
                console_out_str(" *ta: value must be 0000 or 0001\n");
                msg->status = APP_CONSOLE_ERR_BAD_DATA;
                return;
            }

            wm8904_audio_avas_enable_set(value != 0u);
        }
        msg->status = APP_CONSOLE_OK;
        return;
    }

