sulaolab/dspic33ck-hal-lab/src/boards/ev88g73a/main.c
    /*
     * 'v' -- WHICH AVAS VOICE. `?tv` reports the loaded voice, whether it is sounding
     * and which voices this image contains; `*tv0000` selects Type_TY L1 and `*tv0001`
     * the Type_LB L3, WITHOUT starting either -- that is what the 'a' / 'A' hotkeys
     * are for, and keeping the two apart is what makes this form usable from a script
     * where "and also start making noise" would be a surprise.
     *
     * Explicit value, no bare form, for the same reason as *ta and *tq: "whichever one
     * you are not on" is the wrong thing to send when the answer depends on a state the
     * sender cannot see. It refuses while the engine still owns its oscillators (fade
     * included) and prints why -- see wm8904_audio_avas_voice_set().
     */
    if (msg->name == 'v') {
        if (msg->kind == '?') {
            if (msg->data_len != 0u) {
                console_out_str(" ?tv: takes no value\n");
                msg->status = APP_CONSOLE_ERR_BAD_PARM_LEN;
                return;
            }
            wm8904_audio_avas_voice_report();
            msg->status = APP_CONSOLE_OK;
            return;
        }

        {
            uint16_t value;

            if ((msg->data_len == 0u) || (msg->data_len > 2u)) {
                console_out_str(" *tv: needs a value -- *tv0000 = type_ty,"
                                " *tv0001 = type_lb (selects only; a / A also start)\n");
                msg->status = APP_CONSOLE_ERR_BAD_PARM_LEN;
                return;
            }

            value = (msg->data_len == 2u)
                        ? (uint16_t)(((uint16_t)msg->data[0] << 8) | (uint16_t)msg->data[1])
                        : (uint16_t)msg->data[0];

            if (value > 1u) {
                console_out_str(" *tv: value must be 0000 (type_ty) or 0001 (type_lb)\n");
                msg->status = APP_CONSOLE_ERR_BAD_DATA;
                return;
            }

            msg->status = wm8904_audio_avas_voice_set((uint8_t)value)
                              ? APP_CONSOLE_OK
                              : APP_CONSOLE_ERR_BAD_DATA;
        }
        return;
    }

    /*
     * 'b' -- which parts of the AVAS engine run. *tb0007 = everything, which is the
     * boot default and now fits (67.8 % of the block period; the 115 % that once
     * made *tb0005 the only usable mode was generated code, not the algorithm).
     * *tb0005 = carriers + gate
     * with the envelope frozen, kept because switching between the two is how the
     * inter-line beating is heard rather than asserted. Explicit value for the same
     * reason as *tq and *ta.
     */
#if WM8904_AUDIO_ENABLE_TDM_DIAG
    if (msg->name == 'b') {
        if (msg->kind == '?') {
            wm8904_audio_avas_parts_report();
            msg->status = APP_CONSOLE_OK;
            return;
        }
        {
            uint16_t value;

            if ((msg->data_len == 0u) || (msg->data_len > 2u)) {
                wm8904_audio_avas_parts_usage();
                msg->status = APP_CONSOLE_ERR_BAD_PARM_LEN;
                return;
            }
            value = (msg->data_len == 2u)
                        ? (uint16_t)(((uint16_t)msg->data[0] << 8) | (uint16_t)msg->data[1])
                        : (uint16_t)msg->data[0];
            /* Bound and usage both asked of the app module rather than spelled out
             * here: this file talks to the app module, not to the engine, and
             * including the engine header just for a bound would put a DSP dependency
             * in a board profile. Spelling it out instead is what left `> 7u` behind
             * when the NOISE bit arrived -- it rejected the legal mask 000f. */
            if (!wm8904_audio_avas_parts_valid(value)) {
                wm8904_audio_avas_parts_usage();
                msg->status = APP_CONSOLE_ERR_BAD_DATA;
                return;
            }
            wm8904_audio_avas_parts_set((uint8_t)value);
        }
        msg->status = APP_CONSOLE_OK;
        return;
    }
#endif /* WM8904_AUDIO_ENABLE_TDM_DIAG -- *tb / ?tb, absent like *tm rather than refused */

    /*
     * 'i' / 'o' -- PRE and POST gain, in tenths of a dB. One handler for the two, because
     * the only difference is which app function is called and duplicating the payload
     * decode and the help text would be two places for the units to drift.
     *
     * THE PAYLOAD IS SIGNED, two's complement in the same 16 bits every other command in
     * this module uses: *ti003C = +6.0 dB, *tiFFF6 = -1.0 dB. An offset encoding (value =
     * tenths + 240) would spare the operator the two's complement at the cost of a bias
     * nothing else in the fleet grammar has -- and hex is already the convention here, so
     * the cast is the smaller surprise. The app module prints the realised dB back either
     * way, which is what actually confirms the sign was read as intended.
     *
     * No bare form: the same explicit-value rule as *tq, *ta and *tb. A bare *ti has no
     * unambiguous meaning (a gain has no "other" state to toggle to), and this is a command
     * whose accidental form would be audible.
     */
    if ((msg->name == 'i') || (msg->name == 'o')) {
        const bool post = (msg->name == 'o');

        if (msg->kind == '?') {
            if (msg->data_len != 0u) {
                console_out_str(post ? " ?to: takes no value\n" : " ?ti: takes no value\n");
                msg->status = APP_CONSOLE_ERR_BAD_PARM_LEN;
                return;
            }
            if (post) {
                wm8904_audio_post_gain_report();
            } else {
                wm8904_audio_pre_gain_report();
            }
            msg->status = APP_CONSOLE_OK;
            return;
        }

        {
            uint16_t value;

            if ((msg->data_len == 0u) || (msg->data_len > 2u)) {
                console_out_str(post ? " *to" : " *ti");
                console_out_str(": needs tenths of a dB, signed hex -- 0000 = 0.0 dB,"
                                " 003C = +6.0 dB, FFF6 = -1.0 dB (0.5 dB grid)\n");
                msg->status = APP_CONSOLE_ERR_BAD_PARM_LEN;
                return;
            }

            /* A one-byte payload is sign-extended, so *tiF6 and *tiFFF6 both mean -1.0 dB
             * -- the width is a typing convention here exactly as it is for *tq, and a
             * short form that silently meant +246 tenths would be the one encoding mistake
             * loud enough to hurt. */
            value = (msg->data_len == 2u)
                        ? (uint16_t)(((uint16_t)msg->data[0] << 8) | (uint16_t)msg->data[1])
                        : (uint16_t)(int16_t)(int8_t)msg->data[0];

