sulaolab/dspic33ck-hal-lab/src/boards/ev88g73a/main.c
/*
 * Single-key hotkeys for this board, reached through console_board_hotkey() in
 * ev88g73a_console_out.c. Two keys, and they are ONE VOICE EACH rather than a key for
 * the engine plus a key for the selection: 'a' = Type_TY L1, 'A' = Type_LB L3,
 * fully exclusive at run time. Pressing the letter of the voice that is sounding stops
 * it; pressing the other one's letter refuses and says why, because a switch re-seeds
 * every oscillator and mid-sound that is a click. Both letters go through the one
 * entry point wm8904_audio_avas_voice_key() so they cannot come to mean different
 * shapes of thing -- see wm8904_audio.h, where the rule and sonora's precedent are.
 *
 * A ONE-VOICE IMAGE STILL BINDS BOTH, deliberately: 'A' there prints that the image
 * holds only the other voice and how to build one that holds both. A key that does
 * nothing is indistinguishable from a console that stopped listening, which on this
 * board is a real failure mode and not a hypothetical one.
 *
 * 'a' -- start/stop the AVAS synth, no Enter. sonora binds the same letter to the same
 * engine (apps/classic/classic_console.c: case 'a' -> UsrOperate_avas_synth()), and
 * matching it is the whole point: the two boards are listened to in one session, by ear,
 * switching back and forth, and a different key on each is a mistake waiting for the
 * moment your attention is on the sound instead of the keyboard. Since the synth became a
 * stage of the chain path, what this key does matches sonora too: a START from silence
 * begins at t = 0 of the reference and opens over 4 s, and a STOP fades out over ~3 s
 * instead of cutting -- pressed again during that fade it resumes without a phase reset,
 * which is sonora's rule and the reason a jump there would click.
 *
 * IT IS A BARE TOGGLE, WHICH THE *ta GRAMMAR ABOVE DELIBERATELY REFUSES -- so the reason
 * that refusal existed has to be said, not skipped. It was written when entering this
 * path could hang the console: the engine cost 119 % of the block period, an overrun
 * stops the foreground that owns the console, and this board has no reset button, so
 * recovery is a reprogram. What changed is measured rather than assumed -- 289.2 us of a
 * 667 us block, 43.0 %, miss = 0, 382.2 us of margin. The explicit form stays exactly as it was for anything scripted, where
 * "whichever state you are not in" is still the wrong thing to send.
 *
 * The state comes from the audio module rather than a flag kept here, so the key and
 * *ta0001 cannot drift apart -- the same reason sonora's hotkey and its console command
 * share one enable-state source.
 */
bool ev88g73a_transport_console_hotkey(uint8_t ch)
{
    if (ch == (uint8_t)'a') {
        wm8904_audio_avas_voice_key((uint8_t)WM8904_AUDIO_AVAS_VOICE_TYPE_TY);
        return true;
    }

    if (ch == (uint8_t)'A') {
        wm8904_audio_avas_voice_key((uint8_t)WM8904_AUDIO_AVAS_VOICE_TYPE_LB);
        return true;
    }

    return false;
}
#endif

/*
 * LED0 blink, and a standing check on the clock.
 * ----------------------------------------------
 * Timing comes from Timer1, not a software delay loop, so the period is exact in Fcy
 * terms. A `while (count--) nop;` loop costs an unknown, compiler- and -O-dependent
 * number of cycles per iteration; that unknown multiplies into the elapsed time and is
 * indistinguishable from a clock error.
 *
 * SINCE 2026-08-03 THIS FILE NO LONGER OWNS TIMER1. It used to program T1CON/PR1 here
 * directly for a 100 ms period and poll IFS0bits.T1IF, with interrupts disabled -- so
 * this profile had a timer and no running time, and every cadence in it was expressed as
 * a COUNT OF 100 ms periods. app/timer_app.c now owns the timer and the vector, and the
 * cadences below are milliseconds against GetTicks().
 *
 * WHAT SURVIVES THE MOVE, AND HAD TO: the tick is clocked from the peripheral clock
 * (Fp = Fcy) and told the ASSUMED target Fcy as a compile-time constant, deliberately not
 * nora_clock_get_fcy_hz(). Using the HAL's own belief would self-correct and mask a
 * wrong operating point; against a fixed constant every GetTicks() millisecond is a
 * measurement of the real clock, and the blink is how you read it:
 *
 *     actual Fcy = EV88G73A_ASSUMED_FCY_HZ * 10 / (seconds for 10 cycles)
 *
 * One full ON->OFF->ON cycle is 1.000 s exactly when Fcy is on target. Verified on
 * hardware 2026-07-28: 10 cycles in 10 s, i.e. Fcy = 100 MHz. This is how the half-speed
 * clock behind the original garbled console was caught (it read 10 cycles in ~18-20 s),
 * and it is cheap to keep as a regression check -- the console cannot report a clock error
 * that breaks the console itself. A tick that fell back to the FRC instead would show up
 * as an obviously wrong blink (8 MHz vs 100 MHz), not as a silently correct one, which is
 * why timer_app offers the two clock sources as separate calls.
 *
 * The 1 ms period is exact at this Fcy: 100 MHz / 8 (prescale) / 1000 = 12500 counts,
 * PR1 = 12499. timer_app_start_from_fcy() refuses inexact divisors rather than rounding,
 * so a future operating point that cannot make a whole millisecond says so at bring-up.
 */
#define EV88G73A_ASSUMED_FCY_HZ (EV88G73A_TARGET_FOSC_HZ / 2UL)  /* 100 MHz */

/* 500 ms per LED state -> 1.000 s full cycle. */
#define EV88G73A_LED_STATE_PERIOD_MS (500u)

/*
 * SW0 sampling cadence, inside the wait rather than once per LED state.
 *
 * A deliberate human press is 100-300 ms, so sampling once per 500 ms iteration would
 * miss taps often enough to look like a broken button. Not sampled every millisecond
 * either, which the running time now makes possible: at 1 ms, contact bounce on RELEASE
 * can be seen as a second press and toggle the pause twice from one gesture. 100 ms is
 * comfortably above bounce and comfortably below the shortest real press -- it is the
 * cadence the polled-Timer1 version happened to have, kept on purpose.
 *
 * THIS APPLIES TO BOTH USES OF SW0, since 2026-08-05. It used to be compiled in only for
 * the blink-pause test, so the AUDIO build -- where SW0 is the mute button -- was left
 * sampling once per 500 ms iteration, and a normal tap was missed outright: the button
 * only answered when held past half a second. The reasoning above never depended on which
 * of the two the press means, so the gate in wait_next_led_edge() is now the union of the
 * two builds and only the action inside differs.
 */
#define EV88G73A_SW0_SAMPLE_PERIOD_MS (100u)

/* The RX DMA callback publishes raw CODEC-IN words once per completed TDM block; the
 * peak/mask calculation belongs in main context. One millisecond preserves a useful
 * sampled meter while keeping that work outside the 0.67 ms audio deadline. */
#define EV88G73A_AUDIO_OBSERVE_PERIOD_MS (1u)

