sulaolab/dspic33ck-hal-lab/src/boards/ev88g73a/main.c
/*
 * Console status/heartbeat cadence, deliberately INDEPENDENT of the LED blink.
 *
 * The 1.000 s LED cycle above is a live clock measurement (see the block comment at the
 * top of this file) and must not be retuned for console readability. So the profile polls
 * still run once per LED state -- SW0 sampling and the I2C1 scope-trigger transaction both
 * need that cadence -- and only the PRINTING is throttled to this period.
 *
 * INDEPENDENT IS NOW LITERALLY TRUE. This used to be
 * EV88G73A_STATUS_PRINT_PERIOD_MS / (periods_per_LED_state * 100), i.e. the print period
 * was a COUNT of LED states and therefore only expressible as a multiple of 500 ms -- a
 * value here that did not divide evenly was silently rounded, and an #error guarded the
 * case where it rounded to zero. Against GetTicks() the two cadences no longer share a
 * unit, so neither constrains the other and the guard is unnecessary. The gate is still
 * evaluated once per iteration, so the effective granularity is one LED state; that is a
 * property of where it is asked, not of how it is expressed.
 *
 * The per-iteration "tick LED0=on/off" line used to be the heartbeat. It is gone: at two
 * lines per second it buried the status lines it was printed alongside, and the LED itself
 * is the better liveness indicator (it is also the clock measurement, which a printf
 * never was).
 */
#define EV88G73A_STATUS_PRINT_PERIOD_MS (2000u)

/*
 * SW0 -> LED0 BLINK PAUSE, and why this exists at all.
 *
 * Everything else in this profile has hardware evidence; LED0 and SW0 did not. LED0 was
 * only ever *watched* (nobody had confirmed the pin drives the physical LED as opposed to
 * the loop merely running), and SW0 was never read in any build but the audio one, where it
 * is the mute button. One gesture closes both: press SW0 and the blink stops, press again
 * and it resumes. A pressed button that does nothing, or a blink that never pauses, points
 * at exactly one of the two pins.
 *
 * NOT ENABLED IN THE AUDIO BUILD. There SW0 is wm8904_audio's mute button
 * (see s_wm8904_audio_port), and one press meaning both "mute" and "stop blinking" makes
 * neither observation clean. The gate is the audio switch itself rather than a separate
 * define, so the two uses of SW0 cannot both be compiled in by accident.
 *
 * WHAT IS PAUSED IS THE LED, NOT THE CADENCE. The 1.000 s blink is also this profile's
 * live clock measurement (see the block comment at the top of this file), so pausing must
 * not touch the Timer1 wait, the console, the report gate or any exerciser -- they all keep
 * running while the LED sits still. That is deliberate: "I paused it" and "it hung" have to
 * stay distinguishable. What distinguishes them is the CONSOLE, which keeps answering
 * commands in every build (console_task_poll() runs inside the Timer1 wait, not between
 * iterations) -- not the periodic status line, which is the weaker signal: it is throttled
 * to a wall-clock period (DEMO_TDM_STATUS_PERIOD_MS, 5 s in the TDM loopback build), so it
 * only tells you something once every few seconds and only if that build is the one running.
 * When this test was written that line was throttled by a CALL COUNT instead, which on this
 * board worked out to one line per nine hours -- it proved nothing at all then. The console
 * is still the primary liveness evidence; the status line is now a slow second opinion.
 * The LED parks OFF so that paused is unambiguous at a glance.
 */
#if !DEMO_ENABLE_WM8904_AUDIO
#define EV88G73A_SW0_PAUSES_BLINK 1
#else
#define EV88G73A_SW0_PAUSES_BLINK 0
#endif

#if EV88G73A_SW0_PAUSES_BLINK
/*
 * Sampled at 100 ms inside the Timer1 wait, not once per 500 ms iteration, and latched.
 * A deliberate human press is 100-300 ms, so a once-per-iteration sample would miss taps
 * often enough to look like a broken button -- which is the exact ambiguity this test is
 * supposed to remove. The latch is consumed by profile_wait_next_tick(), so a press is
 * acted on once no matter how long it is held; releasing is not required to be seen.
 *
 * No debounce: contact bounce is sub-millisecond to a few ms, an order of magnitude below
 * this sampling interval, and the edge that matters is the first one either way.
 *
 * Not volatile: both the setter and the consumer run in MAIN context, so there is no
 * concurrency here to guard against. That reasoning used to be "this profile has no ISR at
 * all -- Timer1 is polled", which stopped being true on 2026-08-03 when the 1 ms tick
 * became interrupt-driven (app/timer_app.c). The conclusion survives for a better reason:
 * sw0_latch_poll() is called from the wait loop and sw0_take_press() from the iteration
 * body, both in main context, and nothing in the tick path touches this. Should SW0 ever
 * be sampled from the tick hook, this has to become volatile.
 */
static bool s_sw0_press_latched;

static void sw0_latch_poll(void)
{
    static bool was_pressed;
    bool        pressed = ev88g73a_sw0_pressed();

    if (pressed && !was_pressed) {
        s_sw0_press_latched = true;
    }
    was_pressed = pressed;
}

static bool sw0_take_press(void)
{
    bool pressed = s_sw0_press_latched;

    s_sw0_press_latched = false;

    return pressed;
}
#endif /* EV88G73A_SW0_PAUSES_BLINK */

/*
 * Is SW0 sampled inside the wait? Yes in either build that reads it at all -- the union of
 * the blink-pause test and the audio build's mute button. The two are mutually exclusive by
 * construction (EV88G73A_SW0_PAUSES_BLINK is !DEMO_ENABLE_WM8904_AUDIO), so this never
 * compiles both actions in; it exists so the CADENCE is stated once and cannot be given to
 * one use and forgotten for the other, which is exactly the defect it was added to fix.
 */
#if EV88G73A_SW0_PAUSES_BLINK || DEMO_ENABLE_WM8904_AUDIO
#define EV88G73A_SW0_SAMPLED_IN_WAIT 1
#else
#define EV88G73A_SW0_SAMPLED_IN_WAIT 0
#endif

/*
 * Wait out one LED state, servicing the console throughout.
 *
 * THE DEADLINE ADVANCES BY THE PERIOD, it is not resampled: `s_led_edge_ms +=` rather
 * than the fleet's usual `last = GetTicks()`. Both are wrap-safe; the difference is
 * drift. Resampling loses the fraction of a millisecond by which each wait overshoots, so
 * a 500 ms state becomes 500-501 ms and the LED cycle -- which is this profile's clock
 * MEASUREMENT -- would read up to 0.2% slow for reasons that have nothing to do with the
 * clock. Adding the period keeps the edges on an exact 500 ms grid and any single late
 * iteration is absorbed by the next. Print cadences resample, because they are cadences;
 * this one does not, because it is an instrument.
 *
 * Seeded on first call rather than at bring-up: the first state is then 500 ms measured
 * from when the loop actually starts, not from bring-up, so the banner and the codec's
 * own multi-hundred-millisecond init do not eat into it and show up as a short first
 * blink.
 */
static void wait_next_led_edge(void)
{
    static uint32_t s_led_edge_ms;
    static bool     seeded;
#if EV88G73A_SW0_SAMPLED_IN_WAIT
    uint32_t sw0_sample_ms;
#endif
#if DEMO_ENABLE_WM8904_AUDIO
    uint32_t audio_observe_ms;
#endif

