sulaolab/dspic33ck-hal-lab/src/boards/ev88g73a/main.c
    if (!seeded) {
        s_led_edge_ms = GetTicks();
        seeded = true;
    }
#if EV88G73A_SW0_SAMPLED_IN_WAIT
    sw0_sample_ms = s_led_edge_ms;
#endif
#if DEMO_ENABLE_WM8904_AUDIO
    audio_observe_ms = s_led_edge_ms;
#endif

    while ((uint32_t)(GetTicks() - s_led_edge_ms) < EV88G73A_LED_STATE_PERIOD_MS) {
        /*
         * Service the console here rather than once per main-loop iteration. The loop
         * spends essentially all of its ~500 ms inside this wait, and the UART RX path is
         * polled with no ring buffer -- draining only between iterations would let a typed
         * command overrun the hardware FIFO and arrive as fragments. This wait is
         * otherwise doing nothing.
         */
#if DEMO_ENABLE_CONSOLE_COMMANDS
        console_task_poll();
#endif

#if DEMO_ENABLE_WM8904_AUDIO
        if ((uint32_t)(GetTicks() - audio_observe_ms) >=
            EV88G73A_AUDIO_OBSERVE_PERIOD_MS) {
            /* Resample rather than catch up: this is intentionally a diagnostic meter,
             * not a real-time audio task, and it must not extend a late wait iteration. */
            audio_observe_ms = GetTicks();
            wm8904_audio_rx_observe_poll();
        }
#endif

#if EV88G73A_SW0_SAMPLED_IN_WAIT
        if ((uint32_t)(GetTicks() - sw0_sample_ms) >= EV88G73A_SW0_SAMPLE_PERIOD_MS) {
            sw0_sample_ms += EV88G73A_SW0_SAMPLE_PERIOD_MS;
#if EV88G73A_SW0_PAUSES_BLINK
            sw0_latch_poll();
#else
            /* Audio build: SW0 is the mute button. This does the edge detection and
             * publishes the request; it prints one line per press and nothing otherwise,
             * so calling it 5x per LED state costs nothing on the console. */
            wm8904_audio_button_poll();
#endif
        }
#endif
    }

    s_led_edge_ms += EV88G73A_LED_STATE_PERIOD_MS;
}

static void report_operating_point(void)
{
    console_out_str(
        "\nEV88G73A dsPIC33CK64MC105 bring-up: LED0/UART alive\n");

    /*
     * Build ID, so a console check can prove which IMAGE restarted rather than
     * merely that the board restarted. The banner line above is printed by every
     * build, old ones included -- so if a drag-and-drop programming attempt is
     * rejected and the board just resets, matching on the banner alone still
     * "passes". This line is what buildtools/flash-curiositynano.ps1's
     * -VerifyUartContains should be pointed at. build.ps1 supplies the value;
     * builds without it say so rather than printing a misleading blank.
     */
    console_out_str("Build ID = ");
#if defined(EV88G73A_HAVE_BUILD_ID_H)
    console_out_str(EV88G73A_BUILD_ID);
#else
    console_out_str("(not stamped)");
#endif
    console_out_str("\n");

    /* Why this boot happened. SWR here means the *sr console command worked;
     * POR means the board was power-cycled. With no reset button on the Nano,
     * that is the only way to tell those two apart. */
    console_out_str("Reset    = ");
    console_out_str(board_reset_cause_str());
    console_out_str("\n");

    /* Frequencies from the Clock HAL, verdict from the board's volatiles -- the same two
     * places DM330030 keeps them. The ev88g73a_fosc_hz()/_clock_at_target()/... wrappers
     * this used to call are gone; see ev88g73a_board.h. */
    console_out_str("Fosc Hz  = ");
    console_out_u32(nora_clock_get_fosc_hz());
    console_out_str("\nFcy Hz   = ");
    console_out_u32(nora_clock_get_fcy_hz());
    console_out_str("\nBaud     = ");
    console_out_u32(nora_uart_get_baudrate(EV88G73A_CONSOLE_UART_INST));
    console_out_str("\nClock    = ");
    console_out_str(
        g_ev88g73a_clock_on_target ? "PLL at target\n"
                                   : "NOT at target (fell back to FRC)\n");
    console_out_str("PLLstatus= ");
    console_out_u32((uint32_t)g_ev88g73a_clock_init_status);
    console_out_str("  (0 = OK, 4 = timeout)\nPLLdiag  = ");
    console_out_u32((uint32_t)g_ev88g73a_clock_diag);
    console_out_str("  (0 = none, 1 = no switch, 2 = no lock, 8 = switch ignored)\n");

    /* What actually landed in the PLL, read back from the registers rather than
     * recomputed, plus COSC/LOCK so a silent failure to switch or lock is
     * visible instead of being inferred from the frequency.
     *
     * DELIBERATELY READ DIRECTLY AND NOT THROUGH THE CLOCK HAL. The HAL offers
     * nora_clock_dspic33ck_raw_capture() for exactly these four words, and using it here
     * would be the tidier call -- but then the banner and the HAL would read the registers
     * through one shared path, so they could only ever agree. These four lines are the
     * INDEPENDENT reading that can contradict "Fosc Hz" above, and that is their whole
     * value: on 2026-08-10 they are what confirmed the new HAL's derived 200 MHz against
     * the actual divider chain, and what showed a comment in ev88g73a_board.c had been
     * quoting dividers this board never ran. Keep them independent. */
    console_out_str("PLLPRE   = ");
    console_out_u32((uint32_t)CLKDIVbits.PLLPRE);
    console_out_str("\nPLLFBDIV = ");
    console_out_u32((uint32_t)PLLFBDbits.PLLFBDIV);
    console_out_str("\nPOST1DIV = ");
    console_out_u32((uint32_t)PLLDIVbits.POST1DIV);
    console_out_str("\nPOST2DIV = ");
    console_out_u32((uint32_t)PLLDIVbits.POST2DIV);
    /* From the post-switch snapshot, not from OSCCON now: a fallback to the FRC
     * would otherwise overwrite the very evidence we want. */
    console_out_str("\nCOSC@sw  = ");
    console_out_u32(
        ((uint32_t)g_ev88g73a_osccon_after_switch >> 12) & 0x7u);
    /* The raw OSCCON.COSC code, not a yes/no. The legend names only the two values this
     * board can end on -- its target and its fallback -- because those are the only two
     * it asks for; a third value here would mean something wrote NOSC that this board
     * did not, and is worth seeing as the number it is rather than as "other". */
    console_out_str("  (COSC code: 1 = FRC+PLL, 0 = FRC)\nLOCK@sw  = ");
    console_out_u32(
        ((uint32_t)g_ev88g73a_osccon_after_switch >> 5) & 0x1u);
    console_out_str("\n");
}

