sulaolab/dspic33ck-hal-lab/src/boards/ev88g73a/main.c
/*
 * LED state, the print throttle and the wait all live here together: they are one cadence.
 * The LED half-period IS the loop period (and doubles as the live clock check described at
 * the top of this file), so splitting them across hooks would let one be retuned without
 * the other.
 *
 * The print throttle used to be a COUNT of LED states and is now a millisecond period
 * against GetTicks() (2026-08-03), which is what makes "independent of the blink" more
 * than an intention -- see EV88G73A_STATUS_PRINT_PERIOD_MS.
 */
bool profile_wait_next_tick(void)
{
    static bool     led_on;
    static uint32_t status_last_ms;
    bool            report;

#if EV88G73A_SW0_PAUSES_BLINK
    static bool blink_paused;

    if (sw0_take_press()) {
        blink_paused = !blink_paused;
        console_out_str(blink_paused ? "SW0: LED0 blink paused (loop still running)\n"
                                     : "SW0: LED0 blink resumed\n");
    }

    if (blink_paused) {
        /* Park OFF, once, then leave the pin alone -- see the note above. */
        if (led_on) {
            led_on = false;
            ev88g73a_led0_set(false);
        }
    } else {
        led_on = !led_on;
        ev88g73a_led0_set(led_on);
    }
#else
    led_on = !led_on;
    ev88g73a_led0_set(led_on);
#endif

    /*
     * Resampled (`= GetTicks()`), unlike the LED edge which advances by its period: this
     * is a print cadence, not a measurement, so absorbing the overshoot is right -- two
     * status lines must never come out closer together than the period, and being a
     * millisecond late is invisible. See wait_next_led_edge() for the other choice and
     * why it is the other choice.
     */
    report = ((uint32_t)(GetTicks() - status_last_ms) >= EV88G73A_STATUS_PRINT_PERIOD_MS);
    if (report) {
        status_last_ms = GetTicks();
    }

    wait_next_led_edge();

    return report;
}
